src/test/JmeterTest/100users/Thread Group_bulk_100users.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group_bulk_100users" enabled="true">
      <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
        <boolProp name="LoopController.continue_forever">false</boolProp>
        <stringProp name="LoopController.loops">2</stringProp>
      </elementProp>
      <stringProp name="ThreadGroup.num_threads">100</stringProp>
      <stringProp name="ThreadGroup.ramp_time">1</stringProp>
      <boolProp name="ThreadGroup.scheduler">false</boolProp>
      <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
    </ThreadGroup>
    <hashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
        <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments">
            <elementProp name="" elementType="HTTPArgument">
              <boolProp name="HTTPArgument.always_encode">false</boolProp>
              <stringProp name="Argument.value">[{&#xd;
    &quot;applicationId&quot;: &quot;Kafka001&quot;,&#xd;
    &quot;traceId&quot;: &quot;kafka001_tr&quot;,&#xd;
    &quot;requestId&quot; :&quot;01&quot;,&#xd;
    &quot;componentName&quot;: &quot;Kafka&quot;,&#xd;
    &quot;severity&quot;: &quot;3&quot;,&#xd;
    &quot;timestamp&quot;: &quot;2023-04-19T12:57:37.801+00:00&quot;,&#xd;
    &quot;message&quot;: &quot;Hello to Kafka File&quot;&#xd;
&#xd;
},&#xd;
{&#xd;
    &quot;applicationId&quot;: &quot;Kafka001&quot;,&#xd;
    &quot;traceId&quot;: &quot;kafka001_tr&quot;,&#xd;
    &quot;requestId&quot; :&quot;01&quot;,&#xd;
    &quot;componentName&quot;: &quot;Kafka&quot;,&#xd;
    &quot;severity&quot;: &quot;3&quot;,&#xd;
    &quot;timestamp&quot;: &quot;2023-04-19T12:57:37.801+00:00&quot;,&#xd;
    &quot;message&quot;: &quot;Hello to Kafka File&quot;&#xd;
&#xd;
}]</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="HTTPSampler.domain">localhost</stringProp>
        <stringProp name="HTTPSampler.port">8080</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.path">log/bulk</stringProp>
        <stringProp name="HTTPSampler.method">POST</stringProp>
        <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
      </HTTPSamplerProxy>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>